[
  {
    "id": "1-1",
    "level": 1,
    "english": "I have a new cat. The cat is good and he likes to play. He is on the table now. I want to give him some milk because he is hungry. Do you like cats?",
    "spanish": "Tengo un gato nuevo. El gato es bueno y le gusta jugar. Él está sobre la mesa ahora. Quiero darle algo de leche porque tiene hambre. ¿Te gustan los gatos?"
  },
  {
    "id": "1-2",
    "level": 1,
    "english": "My friend works in a store. She goes to work every day. The store is new and many people go there. She says that her work is good but she wants more time for her family.",
    "spanish": "Mi amiga trabaja en una tienda. Ella va al trabajo todos los días. La tienda es nueva y mucha gente va allí. Ella dice que su trabajo es bueno pero quiere más tiempo para su familia."
  },
  {
    "id": "1-3",
    "level": 1,
    "english": "We are at the park with our friends. It is a good day. Look at the sun! We want to go out and see the trees. Most people like to come here because it is beautiful.",
    "spanish": "Estamos en el parque con nuestros amigos. Es un buen día. ¡Mira el sol! Queremos salir y ver los árboles. A la mayoría de la gente le gusta venir aquí porque es hermoso."
  },
  {
    "id": "1-4",
    "level": 1,
    "english": "Who is that man? I do not know him. He looks like your brother. He has a book in his hand. I think he wants to give the book to you or me. Let's go and see.",
    "spanish": "¿Quién es ese hombre? No lo conozco. Se parece a tu hermano. Tiene un libro en su mano. Creo que quiere darnos el libro a ti o a mí. Vamos a ver."
  },
  {
    "id": "1-5",
    "level": 1,
    "english": "First, take two apples from the box. Then, give one to me. I will eat it now. If you want the other one, you can have it. These apples are very good for us.",
    "spanish": "Primero, toma dos manzanas de la caja. Luego, dame una. La comeré ahora. Si quieres la otra, puedes tenerla. Estas manzanas son muy buenas para nosotros."
  },
  {
    "id": "1-6",
    "level": 1,
    "english": "It is time to go home now. I have no work today. I want to see my family and eat good food. You can come with us if you want. It will be a good time.",
    "spanish": "Es hora de ir a casa ahora. No tengo trabajo hoy. Quiero ver a mi familia y comer buena comida. Puedes venir con nosotros si quieres. Será un buen momento."
  },
  {
    "id": "1-7",
    "level": 1,
    "english": "Look at this thing. What is it? I do not know. It looks new. Can you use it? No, I think it is not for me. Give it to her. She knows what to do.",
    "spanish": "Mira esta cosa. ¿Qué es? No lo sé. Parece nueva. ¿Puedes usarla? No, creo que no es para mí. Dásela a ella. Ella sabe qué hacer."
  },
  {
    "id": "1-8",
    "level": 1,
    "english": "Do you see the people over there? They are my new friends. They come from a good place. We like to talk about our year. Most of them work with me.",
    "spanish": "¿Ves a la gente de allá? Son mis nuevos amigos. Vienen de un buen lugar. Nos gusta hablar sobre nuestro año. La mayoría de ellos trabaja conmigo."
  },
  {
    "id": "1-9",
    "level": 1,
    "english": "I want to find a new way. This way is not good. I think we can do it better. If we work, we will get it. Who is with me? Let's go up.",
    "spanish": "Quiero encontrar un nuevo camino. Este camino no es bueno. Creo que podemos hacerlo mejor. Si trabajamos, lo conseguiremos. ¿Quién está conmigo? Vamos arriba."
  },
  {
    "id": "1-10",
    "level": 1,
    "english": "Do you have any water? I see some in the glass. It is for you. Take it. It is good because the day is hot. Drink it all. Then we can go.",
    "spanish": "¿Tienes agua? Veo algo en el vaso. Es para ti. Tómalo. Es bueno porque el día es caluroso. Bébelo todo. Luego podemos irnos."
  },
  {
    "id": "1-11",
    "level": 1,
    "english": "Which one do you like? This one or that one? I think this one is better than the other. Even if it is old, it is good as new. Tell me which way to go.",
    "spanish": "¿Cuál te gusta? ¿Este o aquel? Creo que este es mejor que el otro. Incluso si es viejo, es tan bueno como nuevo. Dime qué camino tomar."
  },
  {
    "id": "1-12",
    "level": 1,
    "english": "I would like to see him, but he is not back. Could you call him? He went into the house just now. After he comes out, we can talk well.",
    "spanish": "Me gustaría verlo, pero no ha vuelto. ¿Podrías llamarlo? Entró en la casa justo ahora. Después de que salga, podemos hablar bien."
  },
  {
    "id": "1-13",
    "level": 1,
    "english": "The dog wants its food. It is only a small dog. It looks at us because it wants to eat. Also, it wants to play. Give it some time.",
    "spanish": "El perro quiere su comida. Es solo un perro pequeño. Nos mira porque quiere comer. También, quiere jugar. Dale algo de tiempo."
  },
  {
    "id": "1-14",
    "level": 1,
    "english": "She was by my side all the year. She helped me make this. It was hard, but we did it well. Now look at how good it is. Only she knows how much work it was.",
    "spanish": "Ella estuvo a mi lado todo el año. Ella me ayudó a hacer esto. Fue difícil, pero lo hicimos bien. Ahora mira qué bueno es. Solo ella sabe cuánto trabajo fue."
  },
  {
    "id": "1-15",
    "level": 1,
    "english": "When will you come? I am here as you said. I have no other place to go. If you could come back now, it would be good. Just do it for me.",
    "spanish": "¿Cuándo vendrás? Estoy aquí como dijiste. No tengo otro lugar a donde ir. Si pudieras volver ahora, sería bueno. Solo hazlo por mí."
  },
  {
    "id": "2-1",
    "level": 2,
    "english": "I live in a big city with my family. Our house is small, but it is a good place. I often ask my children if they like it here. They say yes. We move around the city every day. Life is great here because we are together.",
    "spanish": "Vivo en una gran ciudad con mi familia. Nuestra casa es pequeña, pero es un buen lugar. A menudo pregunto a mis hijos si les gusta aquí. Ellos dicen que sí. Nos movemos por la ciudad todos los días. La vida es genial aquí porque estamos juntos."
  },
  {
    "id": "2-2",
    "level": 2,
    "english": "The young boy goes to school early. He likes to read books. He asked the man a question: 'Is the world big?' The man said, 'Yes, very big.' It was an important thing to know. He wants to learn about different countries.",
    "spanish": "El niño joven va a la escuela temprano. Le gusta leer libros. Le hizo una pregunta al hombre: '¿Es grande el mundo?'. El hombre dijo: 'Sí, muy grande'. Era una cosa importante de saber. Él quiere aprender sobre diferentes países."
  },
  {
    "id": "2-3",
    "level": 2,
    "english": "We did not start the program last night because it was late. We will begin again early in the morning. We need to find a different way. If we work together, we can change the end of the story. Do you have a plan?",
    "spanish": "No empezamos el programa anoche porque era tarde. Comenzaremos de nuevo temprano en la mañana. Necesitamos encontrar una forma diferente. Si trabajamos juntos, podemos cambiar el final de la historia. ¿Tienes un plan?"
  },
  {
    "id": "2-4",
    "level": 2,
    "english": "Turn right and go through the open door. The room is on the other side. You may find a group of people there. Keep your eyes open. It is a real area where people live and play. Put your things down and help us.",
    "spanish": "Gira a la derecha y ve a través de la puerta abierta. La habitación está en el otro lado. Puede que encuentres un grupo de gente allí. Mantén tus ojos abiertos. Es un área real donde la gente vive y juega. Pon tus cosas abajo y ayúdanos."
  },
  {
    "id": "2-5",
    "level": 2,
    "english": "I still need help with the food and water. Do we have enough for every person? I heard that the number of people is high. Please show me the list before we start. We must keep the water in a safe place until the end.",
    "spanish": "Todavía necesito ayuda con la comida y el agua. ¿Tenemos suficiente para cada persona? Oí que el número de personas es alto. Por favor muéstrame la lista antes de empezar. Debemos mantener el agua en un lugar seguro hasta el final."
  },
  {
    "id": "2-6",
    "level": 2,
    "english": "I did not call you last night because it was very late. We talked for a long time the day before. I never want to be far from home. Tell me, how have you been? I miss hearing your voice.",
    "spanish": "No te llamé anoche porque era muy tarde. Hablamos por mucho tiempo el día anterior. Nunca quiero estar lejos de casa. Dime, ¿cómo has estado? Extraño escuchar tu voz."
  },
  {
    "id": "2-7",
    "level": 2,
    "english": "He likes to run fast but he fell down. He hit his head and his hand. It is a hard part of the game. You must try to keep your body strong. If you run again, please watch where you go.",
    "spanish": "A él le gusta correr rápido pero se cayó. Se golpeó su cabeza y su mano. Es una parte dura del juego. Debes intentar mantener tu cuerpo fuerte. Si corres de nuevo, por favor mira a dónde vas."
  },
  {
    "id": "2-8",
    "level": 2,
    "english": "There is a long line at the state office. In this case, we need to wait. Set your things here between the two chairs. Point to the map if you need another place. It seems like we will be here all day.",
    "spanish": "Hay una larga línea en la oficina estatal. En este caso, necesitamos esperar. Pon tus cosas aquí entre las dos sillas. Señala el mapa si necesitas otro lugar. Parece que estaremos aquí todo el día."
  },
  {
    "id": "2-9",
    "level": 2,
    "english": "My old friend has a farm where things grow well. I have known him since we were at school. While I work, he calls my name. We are almost done with the work. It is a different kind of life.",
    "spanish": "Mi viejo amigo tiene una granja donde las cosas crecen bien. Lo conozco desde que estábamos en la escuela. Mientras trabajo, él llama mi nombre. Casi hemos terminado con el trabajo. Es un tipo de vida diferente."
  },
  {
    "id": "2-10",
    "level": 2,
    "english": "Turn off the light, please. Next week, we will play against a big team. Each person has a different idea on how to win. How much time do we have? We must be ready for the game.",
    "spanish": "Apaga la luz, por favor. La próxima semana, jugaremos contra un equipo grande. Cada persona tiene una idea diferente sobre cómo ganar. ¿Cuánto tiempo tenemos? Debemos estar listos para el juego."
  },
  {
    "id": "2-11",
    "level": 2,
    "english": "My child is at school. He has a question about the world. It is very important to ask. I help him find the answer in a book. We read together every night before he goes to sleep.",
    "spanish": "Mi hijo está en la escuela. Tiene una pregunta sobre el mundo. Es muy importante preguntar. Le ayudo a encontrar la respuesta en un libro. Leemos juntos cada noche antes de que se vaya a dormir."
  },
  {
    "id": "2-12",
    "level": 2,
    "english": "We want to move to another country. It is far from this city. The life there is different. It will be a big change for my family. But it is a great place to start again.",
    "spanish": "Queremos mudarnos a otro país. Está lejos de esta ciudad. La vida allí es diferente. Será un gran cambio para mi familia. Pero es un gran lugar para empezar de nuevo."
  },
  {
    "id": "2-13",
    "level": 2,
    "english": "I was early, but he was late. We waited until the end of the day. While we were there, we saw many things. Do not go without me. I am still here waiting for you.",
    "spanish": "Yo llegué temprano, pero él llegó tarde. Esperamos hasta el final del día. Mientras estábamos allí, vimos muchas cosas. No te vayas sin mí. Todavía estoy aquí esperándote."
  },
  {
    "id": "2-14",
    "level": 2,
    "english": "We have a small group of people. The number is not high. Do we have enough food? I think so. Each part of the plan is good. We need to work hard to make it real.",
    "spanish": "Tenemos un grupo pequeño de personas. El número no es alto. ¿Tenemos suficiente comida? Creo que sí. Cada parte del plan es buena. Necesitamos trabajar duro para hacerlo real."
  },
  {
    "id": "2-15",
    "level": 2,
    "english": "Close your eyes and listen. Can you hear the water? It runs down the side of the house. It seems like a good day. Put your hand in the water. It is cold but it feels good.",
    "spanish": "Cierra tus ojos y escucha. ¿Puedes oír el agua? Corre por el costado de la casa. Parece un buen día. Pon tu mano en el agua. Está fría pero se siente bien."
  }
]
